<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Lark.

For the ARCH_TYPE variable use

- "arm64" for Apple Silicon
- x64 for Intel

</string>
    <key>Identifier</key>
    <string>com.github.munki-tvlk.download.Lark</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Lark (Apple)</string>
        <key>ARCH_TYPE</key>
        <string>arm64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>Process</key>
    <array>
<!--        <dict>
            <key>Arguments</key>
            <dict>
                <key>asset_regex</key>
                <string>Rancher\.Desktop-([0-9]+(\.[0-9]+)+)\.%ARCH_TYPE%\.dmg$</string>
                <key>github_repo</key>
                <string>rancher-sandbox/rancher-desktop</string>
            </dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
       </dict>
-->        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
				<string>https://*.larksuitecdn.com/obj/lark-artifact-storage/*/Lark-darwin_%ARCH_TYPE%-[0-9]+.[0-9]+.[0-9]+-signed.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/LarkSuite.app</string>
                <key>requirement</key>
                <string>identifier "com.larksuite.larkApp" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JBRN9C6V7T</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/LarkSuite.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
    </array>
</dict>
</plist>
