<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Lark.

    For Apple Silicon:
    ARCH: arm64, SUPPORTED_ARCHITECTURE: arm64

    For Intel:
    ARCH: x64, SUPPORTED_ARCHITECTURE: x86_64

    </string>
    <key>Identifier</key>
    <string>com.github.munki-tvlk.download.Lark-Suite</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Lark Suite(Apple)</string>
        <key>ARCH</key>
        <string>arm64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.larksuite.com/en_us/download</string>
                <key>re_pattern</key>
                <string>https://sf16-va.larksuitecdn.com/obj/lark-artifact-storage/*/Lark-darwin_%ARCH%-([\d\.]+[\d\.]+[\d\])-signed.dmg</string>
				<key>result_output_var_name</key>
				<string>version</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.larksuite.com/en_us/downloadhttps://sf16-va.larksuitecdn.com/obj/lark-artifact-storage/*/Lark-darwin_%ARCH%-%version%-signed.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
                <key>input_path</key>
                <string>%pathname%/LarkSuite.app</string>
                <key>requirement</key>
                <string>identifier "com.larksuite.larkApp" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JBRN9C6V7T</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/LarkSuite.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
    </array>
</dict>
</plist>
