<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest DMG version of Vysor. Set PRERELEASE to a non-empty string to download prereleases, either
    via Input in an override or via the -k option,i.e.: `-k PRERELEASE=yes`</string>
    <key>Identifier</key>
    <string>com.github.munki-tvlk.download.Vysor</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Vysor</string>
        <key>PRERELEASE</key>
        <string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>asset_regex</key>
                <string>(.*?\.dmg)</string>
                <key>github_repo</key>
                <string>koush/vysor.io</string>
            </dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Vysor.app</string>
                <key>requirement</key>
                <string>identifier "com.electron.vysor" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = XT4C9EJNUG</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>