<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Appium Inspector and imports it into Munki.
        For Apple Silicon:
        ARCH: arm64, SUPPORTED_ARCHITECTURE: arm64

        For Intel:
        ARCH: x64, SUPPORTED_ARCHITECTURE: x86_64
    </string>
    <key>Identifier</key>
    <string>com.github.munki-tvlk.munki.Appium-Inspector</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>NAME</key>
        <string>Appium Inspector(Apple)</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>Testing</string>
            </array>
            <key>description</key>
            <string>Image inspector.</string>
			<key>developer</key>
			<string>OpenJS Foundation, Inc.</string>
			<key>display_name</key>
			<string>Appium Inspector(Apple)</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>supported_architectures</key>
            <array>
                <string>%ARCH%</string>
            </array>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.munki-tvlk.download.Appium-Inspector</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
