<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Homebrew.</string>
    <key>Identifier</key>
    <string>com.github.munki-tvlk.download.Homebrew</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Homebrew</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3.0</string>
    <key>Process</key>
 <array>
    <!-- Ambil info release GitHub -->
    <dict>
        <key>Processor</key>
        <string>GitHubReleasesInfoProvider</string>
        <key>Arguments</key>
        <dict>
            <key>github_repo</key>
            <string>Homebrew/brew</string>
            <key>asset_regex</key>
            <string>Homebrew-[0-9]+\.[0-9]+\.[0-9]+\.pkg</string>
        </dict>
    </dict>

    <!-- Download file ZIP dengan nama *.pkg.zip -->
    <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
            <key>filename</key>
            <string>%NAME%-%version%.pkg.zip</string>
        </dict>
    </dict>

    <!-- Extract ZIP jadi folder .pkg -->
    <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
            <key>archive_path</key>
            <string>%pathname%</string>
        </dict>
    </dict>
    
    <!-- Verifikasi signature, path ke folder hasil ekstrak (.pkg) -->
    <dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        <key>Arguments</key>
        <dict>
            <!-- Sesuaikan ini dengan nama folder .pkg yang ada di hasil ekstrak -->
            <key>input_path</key>
            <string>%pathname%/Homebrew.pkg</string>
            <key>expected_authority_names</key>
            <array>
                <string>Developer ID Installer: Mike McQuaid (6248TWFRH6)</string>
                <string>Developer ID Certification Authority</string>
                <string>Apple Root CA</string>
            </array>
        </dict>
    </dict>
</array>
</dict>
</plist>
